ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ccf79bb-a7d7-4c19-80ad-eb0164f60ec4">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЖБИ_НаПаузе</name>
    <comment>Поставить поставщика на паузу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ДатаКонтроляЦены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ИндивидуальнаяЦена</name>
    <comment>ЖБИ - ИндивидуальнаяЦена</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ПараметрыЦенообразования/ЖБИ_ПараметрыЦенообразования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ПараметрыЦенообразования</name>
  <comment>ЖБИ - Параметры ценообразования</comment>
  <resources>
    <name>ПроцентНаценки</name>
    <comment>% наценки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПовышающийПроцент</name>
    <comment>Транспортный %</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимаяСкидка</name>
    <comment>Допус. скидка %</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПовышеннаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/Партнеры/Forms/ПомощникНового/Module.bsl
&НаКлиенте
Процедура ЖБИ_ПриОткрытииПосле(Отказ)
	
	ЖБИ_ОбщийМодульСправочники.ЗаполнитьФормуОткрытия(ЭтаФорма);	
	ВидимостьСтраницПервичнаяИнформация();	
	Элементы.ВидЮрЛицо.Доступность = УказыватьЮридическиеРеквизиты;	
	
КонецПроцедуры

&НаКлиенте
&После("Далее")
Процедура ЖБИ_Далее(Команда)
	
	Если ПустаяСтрока(ИНН) Тогда
		ВывестиСообщениеПользователю(НСтр("ru = 'Не указан ИНН'"),"ИНН");
		Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаПервичнаяИнформация;
		ЖБИ_ОбщийМодульСправочники.ЗаполнитьФормуОткрытия(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("Назад")
Процедура ЖБИ_Назад(Команда)
	ЖБИ_ОбщийМодульСправочники.ЗаполнитьФормуОткрытия(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
&После("ЗаполнитьРеквизитыКонтрагентаПоПолученнымДанным")
Процедура ЖБИ_ЗаполнитьРеквизитыКонтрагентаПоПолученнымДанным(РеквизитыКонтрагента)	
	ПолноеНаименование = "";	
КонецПроцедуры

&НаСервере
&После("ЗаписатьПартнераИСвязанныеДанные")
Процедура ЖБИ_ЗаписатьПартнераИСвязанныеДанные(СписокСозданных)
	
	//ЖБИ - Параметры ценообразования
	ТаблицаНабораЗаписей 		= РегистрыСведений.ЖБИ_ПараметрыЦенообразования.ПолучитьПустуюТаблицуНаборЗаписей();
	НоваяСтр 					= ТаблицаНабораЗаписей.Добавить();
	НоваяСтр.Партнер			= ПартнерВыбор;
	НоваяСтр.ПроцентНаценки 	= 22;
	НоваяСтр.ПовышающийПроцент 	= 26;
	НоваяСтр.ДопустимаяСкидка 	= 4;
	НоваяСтр.Автор 				= Пользователи.ТекущийПользователь();
	
	СообщениеОбОшибки			= "";
	СписокСвойствОбновления 	= "";
	Результат 					= РегистрыСведений.ЖБИ_ПараметрыЦенообразования.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,
									СписокСвойствОбновления,,СообщениеОбОшибки);									
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибки);										
	КонецЕсли;
	
	//Виды цен поставщиков
	СпрОбъектЦеныПоставщика 		 			= Справочники.ВидыЦенПоставщиков.СоздатьЭлемент();
	СпрОбъектЦеныПоставщика.Владелец 			= ПартнерВыбор;
	СпрОбъектЦеныПоставщика.Валюта   			= ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(СпрОбъектЦеныПоставщика.Валюта);
	СпрОбъектЦеныПоставщика.Наименование 		= "Цена с НДС";
	СпрОбъектЦеныПоставщика.ЦенаВключаетНДС     = Истина;
	СпрОбъектЦеныПоставщика.ДоступноДляЗакупки 	= Истина;
	Попытка
		СпрОбъектЦеныПоставщика.Записать();
	Исключение
		СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибки);
	КонецПопытки;
	
КонецПроцедуры
